#+TITLE: Compile time optimization tracker

* reflect_args
** Breakdown

|    Abs |   Rel | Name                      |
|--------+-------+---------------------------|
|      0 |       | Init                      |
|  2.042 | 2.042 | Function()                |
|  3.567 | 1.525 | makeFunction()            |
|  3.984 | 0.417 | initFn()                  |
|  5.135 | 1.151 | makeValueFunction()       |
|  7.006 | 1.871 | ValueFunction()           |
|  8.193 | 1.187 | ValueFunction(fn)         |
| 10.196 | 2.003 | ValueFunction::operator() |
| 11.329 | 1.133 | total                     |
#+TBLFM: @3$2..=$-1-@-1$-1

** History

|    Abs |    Rel | Name                 |
|--------+--------+----------------------|
| 11.329 |        | Init                 |
| 10.727 | -0.602 | FunctionType<Fn>     |
|  5.429 | -5.298 | ValueFunction revamp |
|--------+--------+----------------------|
|  8.637 |  3.208 | Init                 |
#+TBLFM: @3$2..=$-1-@-1$-1

* reflect_getter
** Breakdown

|    Abs |    Rel | Name                |
|--------+--------+---------------------|
|      0 |        | Init                |
|  1.535 |  1.535 | reflectFn           |
|  2.705 |   1.17 | Function()          |
|  5.855 |   3.15 | makeFunction()      |
|  8.932 |  3.077 | makeValueFunction() |
| 12.473 |  3.541 | reflectReturn()     |
| 13.798 |  1.325 | reflectArguments()  |
| 13.769 | -0.029 | total               |
#+TBLFM: @3$2..=$-1 - @-1$-1

** History

|    Abs |    Rel | Name                 |
|--------+--------+----------------------|
| 13.769 |        | Init                 |
| 13.814 |  0.045 | FunctionType<Fn>     |
|  5.267 | -8.547 | ValueFunction revamp |
#+TBLFM: @3$2..=$-1-@-1$-1

* reflect_setter
** Breakdown

|    Abs |    Rel | Name  |
|--------+--------+-------|
|      0 |        | Init  |
| 10.811 | 10.811 | total |
#+TBLFM: @3$2..=$-1 - @-1$-1

** History

|    Abs |    Rel | Name                 |
|--------+--------+----------------------|
| 10.811 |        | Init                 |
| 11.615 |  0.804 | FunctionType<Fn>     |
|  5.281 | -6.334 | ValueFunction revamp |
|--------+--------+----------------------|
|  6.826 |  1.545 | Init                 |
#+TBLFM: @3$2..=$-1-@-1$-1
